## Terraform Plan Result


### environments/stg/db
```

```

### environments/stg/network/sg
```
  + create
  - destroy
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "stg-mysql-db-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "stg-mysql-db-sg"
      + tags_all               = {
          + "Name" = "stg-mysql-db-sg"
      + vpc_id                 = "vpc-07fd028d1425bded5"
  + resource "aws_security_group_rule" "this_sg" {
      + description              = "Allow MySQL from app servers"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0513a4b88ab3790e9"
      + to_port                  = 3306
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Allow HTTP" -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-3773784967" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-05f1679fd9c3bde0c" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Allow HTTPs" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-106609779" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-0ed796f831837f5d1" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow HTTPs"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Allow all outbound traffic" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-4198438869" -> null
      - protocol               = "-1" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-073cedebe771c2e7b" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
  + resource "aws_security_group_rule" "this_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
  - resource "aws_security_group_rule" "this" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Custom SSH port" -> null
      - from_port              = 8080 -> null
      - id                     = "sgrule-2530122292" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-078ac4a9469676214" -> null
      - self                   = false -> null
      - to_port                = 8080 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Custom SSH port"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Custom TCP port" -> null
      - from_port              = 1024 -> null
      - id                     = "sgrule-1020207206" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-012475b8b432fa3aa" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Custom TCP port"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
Plan: 7 to add, 0 to change, 5 to destroy.
Changes to Outputs:
  + mysql_db_sg_id   = (known after apply)
```
<!-- Sticky Pull Request Commentterraform-plan -->